## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                        |
|--------|----------------------------------------------------|
| add    | `aws_iam_policy.quicksight-rds`                    |
|        | `aws_iam_role.quicksight`                          |
|        | `aws_iam_role.vpc_connection_role`                 |
|        | `aws_iam_role_policy_attachment.rds-qs-attach`     |
|        | `aws_quicksight_account_subscription.subscription` |
|        | `aws_quicksight_data_source.rds`                   |
|        | `aws_quicksight_vpc_connection.rds`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.quicksight-rds will be created
  + resource "aws_iam_policy" "quicksight-rds" {
      + arn         = (known after apply)
      + description = "Allow access to RDS"
      + id          = (known after apply)
      + name        = "rds-access"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds-db:connect",
                          + "rds:Describe*",
                          + "rds:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.quicksight will be created
  + resource "aws_iam_role" "quicksight" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "quicksight.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "quicksight"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.vpc_connection_role will be created
  + resource "aws_iam_role" "vpc_connection_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "quicksight.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "QuickSightVPCConnectionRolePolicy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ec2:CreateNetworkInterface",
                              + "ec2:ModifyNetworkInterfaceAttribute",
                              + "ec2:DeleteNetworkInterface",
                              + "ec2:DescribeSubnets",
                              + "ec2:DescribeSecurityGroups",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_iam_role_policy_attachment.rds-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "rds-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "quicksight"
    }

  # aws_quicksight_account_subscription.subscription will be created
  + resource "aws_quicksight_account_subscription" "subscription" {
      + account_name                = "quicksight-test-staging"
      + account_subscription_status = (known after apply)
      + authentication_method       = "IAM_ONLY"
      + aws_account_id              = (known after apply)
      + edition                     = "ENTERPRISE"
      + id                          = (known after apply)
      + notification_email          = "helpdesk@cds-snc.ca"
    }

  # aws_quicksight_data_source.rds will be created
  + resource "aws_quicksight_data_source" "rds" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_source_id = "database"
      + id             = (known after apply)
      + name           = "Quicksight RDS data source"
      + tags_all       = (known after apply)
      + type           = "POSTGRESQL"

      + credentials {
          + credential_pair {
              + password = (sensitive value)
              + username = (sensitive value)
            }
        }

      + parameters {

          + rds {
              + database    = "database"
              + instance_id = "id"
            }
        }

      + vpc_connection_properties {
          + vpc_connection_arn = (known after apply)
        }
    }

  # aws_quicksight_vpc_connection.rds will be created
  + resource "aws_quicksight_vpc_connection" "rds" {
      + arn                 = (known after apply)
      + availability_status = (known after apply)
      + aws_account_id      = (known after apply)
      + id                  = (known after apply)
      + name                = "Quicksight RDS connection"
      + role_arn            = (known after apply)
      + security_group_ids  = [
          + "sg-1",
        ]
      + subnet_ids          = [
          + "subnet-1",
          + "subnet-2",
        ]
      + tags_all            = {}
      + vpc_connection_id   = "vpc-097508d1f5e243195"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
